const express = require("express");
const DBrouter = express.Router();
const cors = require(`cors`);
const bodyParser = require("body-parser");
require("dotenv").config();
const dbUrl = process.env.DBport || "http://localhost:4000";
//const dbUrl = "http://localhost:4000";
const axios = require("axios");
const Helper = require("../Helpers/generalUtils/Helper");
const matrixesHandeler = require("../Helpers/wizCloudUtiles/helpers/calcKi");

DBrouter.use(
  cors({
    origin: "*",
  })
);

console.log(dbUrl);
DBrouter.use(express.json());
DBrouter.use(bodyParser.urlencoded({ extended: true }));
DBrouter.use(bodyParser.json());

const fetchData = async (req, reqUrl, actionHeader) => {
  const data = await req.body;
  console.log("req headers .....", req.headers);
  if (reqUrl == "/api/saveMatrix") {
    console.log(" in save matrix @@@@@@@@@@@@@@@@@@@@@@@")(
      ({ data } = await matrixesHandeler.prererMatixesData({ data }))
    );
  }

  const authHeader = req.headers["authorization"];
  const Type = req.headers["type"];
  let options = {
    url: `${dbUrl}${reqUrl}`,
    method: "POST",
    headers: {
      "Content-Type": "application/json;charset=UTF-8",
      Authorization: authHeader,
      ForcedAction: actionHeader ? actionHeader : null,
    },
    data: data,
  };
  return axios(options).then((result) => result.data);
};

DBrouter.post("/api/loadmatrixes", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  fetchData(req, "/api/loadmatrixes")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});

DBrouter.post("/api/deleteData", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  fetchData(req, "/api/deleteData")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});
DBrouter.post("/api/saveMatrix", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  fetchData(req, "/api/savematrix")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});

// ****************************  MONGO DB END POINTS  **************************** //
DBrouter.post("/api/loadDocUrls", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  fetchData(req, "/api/loadDocUrls")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});

DBrouter.post("/api/getData", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;
  fetchData(req, "/api/getdata")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});

DBrouter.post("/api/Register", async (req, res) => {
  const testMsg = req.testMsg;

  fetchData(req, "/api/register")
    .then((result) => res.send(testMsg ? { result, testMsg } : { result }))
    .catch((e) => res.send(e));
});

DBrouter.post("/api/setConfig", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  const actionHeader = req.headers["forcedaction"];
  // console.log("in matrix ui set config", data);
  fetchData(req, "/api/setConfig", actionHeader)
    .then((result) => {
      console.log("result in fetch %%%%", result);
      let resultData = result;
      res.send(testMsg ? { resultData, testMsg } : { resultData });
    })
    .catch((e) => res.send(e));
});

DBrouter.post("/api/setErpConfig", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;

  const actionHeader = req.headers["forcedaction"];
  console.log("in matrix ui erp config ", data);
  fetchData(req, "/api/setErpConfig", actionHeader)
    .then((result) => {
      console.log("result in fetch %%%%", result);
      let resultData = result.data;
      res.send(testMsg ? { resultData, testMsg } : { resultData });
    })
    .catch((e) => res.send(e));
});
//  *****************************  FIRE BASE END POINTS  **********************************//
DBrouter.post("/api/savesignedFiles", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;
  const options = await req.boby;
  const fetcResult = await fetchData(options, Helper.authenticateToken, "/api/savesignedFils");
  fetcResult.then(res.send(testMsg ? { result, testMsg } : { result }));
});

DBrouter.post("/api/loadsignedFiles", Helper.authenticateToken, async (req, res) => {
  const testMsg = req.testMsg;
  const options = await req.boby;
  const fetcResult = await fetchData(options, Helper.authenticateToken, "/api/loadsignedFiles");
  fetcResult.then(res.send(testMsg ? { result, testMsg } : { result }));
});

module.exports = DBrouter;

let t = [
  {
    "שם פריט": "הרנה 250 גרם",
    "מפתח פריט": "HI250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
  {
    "שם פריט": "אבו מיסמר גדול",
    "מפתח פריט": "AB500SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.5,
    מחסן: 2,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "גת SPXP",
    "מפתח פריט": "SX250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -2798,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SX250BG",
    "שם פריט אב": "שקית לגת SPXP250",
    "תרה כמותית אב": -4,
  },
  {
    "שם פריט": "גת SPXP",
    "מפתח פריט": "SX250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -2798,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SX250BG",
    "שם פריט אב": "שקית לגת SPXP250",
    "תרה כמותית אב": -4,
  },
  {
    "שם פריט": "גת SPXP",
    "מפתח פריט": "SX250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -2798,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SX250BG",
    "שם פריט אב": "שקית לגת SPXP250",
    "תרה כמותית אב": -4,
  },
  {
    "שם פריט": "גת SPXP",
    "מפתח פריט": "SX250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -2798,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SX250BG",
    "שם פריט אב": "שקית לגת SPXP250",
    "תרה כמותית אב": -4,
  },
  {
    "שם פריט": "גת XR",
    "מפתח פריט": "XR100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BAGXP",
    "שם פריט אב": "שקית לגת XP",
    "תרה כמותית אב": -1648,
  },
  {
    "שם פריט": "גת אבו מיסמר לפי משקל",
    "מפתח פריט": "ABKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "גת XR לפי משקל",
    "מפתח פריט": "XRKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "XR",
    "שם פריט אב": "גת XR מוצר אב",
    "תרה כמותית אב": 93.6,
  },
  {
    "שם פריט": "גת בהרדר לפי משקל",
    "מפתח פריט": "BHKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת בהרדר לפי משקל",
    "מפתח פריט": "BHKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת SP מובחר לפי משקל",
    "מפתח פריט": "SPKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "SP",
    "שם פריט אב": "גת SP מוצר אב",
    "תרה כמותית אב": -740.4200000000001,
  },
  {
    "שם פריט": "בהרדר 200 גרם",
    "מפתח פריט": "BH200SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -25,
    משקל: 0.2,
    מחסן: 1,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "בהרדר 200 גרם",
    "מפתח פריט": "BH200SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -25,
    משקל: 0.2,
    מחסן: 1,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת SP מובחר",
    "מפתח פריט": "SP250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1071,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SP250BG",
    "שם פריט אב": "שקית לגת SP250",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת SP מובחר",
    "מפתח פריט": "SP250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1071,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SP250BG",
    "שם פריט אב": "שקית לגת SP250",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת SP מובחר",
    "מפתח פריט": "SP250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1071,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SP250BG",
    "שם פריט אב": "שקית לגת SP250",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת SP מובחר",
    "מפתח פריט": "SP250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1071,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SP250BG",
    "שם פריט אב": "שקית לגת SP250",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת SP מובחר",
    "מפתח פריט": "SP250SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1071,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "SP250BG",
    "שם פריט אב": "שקית לגת SP250",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת קימבו לפי משקל",
    "מפתח פריט": "KIKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת XP לפי משקל",
    "מפתח פריט": "XPKG",
    "קוד מיון": 53200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "אבו מיסמר קטן",
    "מפתח פריט": "AB250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -86,
    משקל: 0.2,
    מחסן: 1,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "אבו מיסמר קטן",
    "מפתח פריט": "AB250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -86,
    משקל: 0.2,
    מחסן: 1,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "קימבו גדול",
    "מפתח פריט": "KI250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -3005,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "קימבו גדול",
    "מפתח פריט": "KI250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": -3005,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "רובטה נתיבות",
    "מפתח פריט": "SA500SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.5,
    מחסן: 1,
    "מפתח פריט אב": "RB",
    "שם פריט אב": "גת נתיבות מוצר אב",
    "תרה כמותית אב": -4.5,
  },
  {
    "שם פריט": "גת הרנה לפי משקל",
    "מפתח פריט": "HIKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
  {
    "שם פריט": "גת הרנה לפי משקל",
    "מפתח פריט": "HIKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
  {
    "שם פריט": "גת בייבי לפי משקל",
    "מפתח פריט": "BBKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "BB",
    "שם פריט אב": "גת בייבי מוצר אב",
    "תרה כמותית אב": -485.2,
  },
  {
    "שם פריט": "גת בייבי",
    "מפתח פריט": "BB100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1969,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BB100BG",
    "שם פריט אב": "שקית לגת בייבי 100",
    "תרה כמותית אב": -426,
  },
  {
    "שם פריט": "גת בייבי",
    "מפתח פריט": "BB100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1969,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BB100BG",
    "שם פריט אב": "שקית לגת בייבי 100",
    "תרה כמותית אב": -426,
  },
  {
    "שם פריט": "גת בייבי",
    "מפתח פריט": "BB100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1969,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BB100BG",
    "שם פריט אב": "שקית לגת בייבי 100",
    "תרה כמותית אב": -426,
  },
  {
    "שם פריט": "גת בייבי",
    "מפתח פריט": "BB100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1969,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BB100BG",
    "שם פריט אב": "שקית לגת בייבי 100",
    "תרה כמותית אב": -426,
  },
  {
    "שם פריט": "גת בייבי",
    "מפתח פריט": "BB100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": -1969,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BB100BG",
    "שם פריט אב": "שקית לגת בייבי 100",
    "תרה כמותית אב": -426,
  },
  {
    "שם פריט": "גת SPXP לפי משקל",
    "מפתח פריט": "SPXPKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "גת SPXP לפי משקל",
    "מפתח פריט": "SPXPKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "גת SPXP לפי משקל",
    "מפתח פריט": "SPXPKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "קימבו קטן",
    "מפתח פריט": "KI100SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת הרנה קפוא לפי משקל",
    "מפתח פריט": "HIF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
  {
    "שם פריט": "גת הרנה קפוא לפי משקל",
    "מפתח פריט": "HIF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
  {
    "שם פריט": "גת XP קפוא לפי משקל",
    "מפתח פריט": "XPF",
    "קוד מיון": 53100,
    "יתרה כמותית במלאי": -1.2,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "גת XP קפוא לפי משקל",
    "מפתח פריט": "XPF",
    "קוד מיון": 53100,
    "יתרה כמותית במלאי": -1.2,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "גת XP קפוא לפי משקל",
    "מפתח פריט": "XPF",
    "קוד מיון": 53100,
    "יתרה כמותית במלאי": -1.2,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "גת XP קפוא לפי משקל",
    "מפתח פריט": "XPF",
    "קוד מיון": 53100,
    "יתרה כמותית במלאי": -1.2,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "גת בהרדר קפוא לפי משקל",
    "מפתח פריט": "BHF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת בהרדר קפוא לפי משקל",
    "מפתח פריט": "BHF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת בהרדר קפוא לפי משקל",
    "מפתח פריט": "BHF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "BH",
    "שם פריט אב": "גת בהרדר מוצר אב",
    "תרה כמותית אב": -15,
  },
  {
    "שם פריט": "גת בייבי קפוא לפי משקל",
    "מפתח פריט": "BBF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "BB",
    "שם פריט אב": "גת בייבי מוצר אב",
    "תרה כמותית אב": -485.2,
  },
  {
    "שם פריט": "גת בייבי קפוא לפי משקל",
    "מפתח פריט": "BBF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "BB",
    "שם פריט אב": "גת בייבי מוצר אב",
    "תרה כמותית אב": -485.2,
  },
  {
    "שם פריט": "גת SP קפוא לפי משקל",
    "מפתח פריט": "SPF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SP",
    "שם פריט אב": "גת SP מוצר אב",
    "תרה כמותית אב": -740.4200000000001,
  },
  {
    "שם פריט": "גת SP קפוא לפי משקל",
    "מפתח פריט": "SPF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SP",
    "שם פריט אב": "גת SP מוצר אב",
    "תרה כמותית אב": -740.4200000000001,
  },
  {
    "שם פריט": "גת SP קפוא לפי משקל",
    "מפתח פריט": "SPF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SP",
    "שם פריט אב": "גת SP מוצר אב",
    "תרה כמותית אב": -740.4200000000001,
  },
  {
    "שם פריט": "גת קימבו קפוא לפי משקל",
    "מפתח פריט": "KIF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת קימבו קפוא לפי משקל",
    "מפתח פריט": "KIF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת קימבו קפוא לפי משקל",
    "מפתח פריט": "KIF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת SPXP קפוא לפי משקל",
    "מפתח פריט": "SXF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "גת SPXP קפוא לפי משקל",
    "מפתח פריט": "SXF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "גת SPXP קפוא לפי משקל",
    "מפתח פריט": "SXF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "SX",
    "שם פריט אב": "גת SPXP מוצר אב",
    "תרה כמותית אב": 91.66,
  },
  {
    "שם פריט": "גת אבו מיסמר קפוא לפי משקל",
    "מפתח פריט": "ABF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": -20,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "גת אבו מיסמר קפוא לפי משקל",
    "מפתח פריט": "ABF",
    "קוד מיון": 51100,
    "יתרה כמותית במלאי": -20,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "גת XR קפוא לפי משקל",
    "מפתח פריט": "XRF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": -21.8,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XR",
    "שם פריט אב": "גת XR מוצר אב",
    "תרה כמותית אב": 93.6,
  },
  {
    "שם פריט": "גת XR קפוא לפי משקל",
    "מפתח פריט": "XRF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": -21.8,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XR",
    "שם פריט אב": "גת XR מוצר אב",
    "תרה כמותית אב": 93.6,
  },
  {
    "שם פריט": "גת XR קפוא לפי משקל",
    "מפתח פריט": "XRF",
    "קוד מיון": 52100,
    "יתרה כמותית במלאי": -21.8,
    משקל: 1,
    מחסן: 3,
    "מפתח פריט אב": "XR",
    "שם פריט אב": "גת XR מוצר אב",
    "תרה כמותית אב": 93.6,
  },
  {
    "שם פריט": "גת XR לפי משקל",
    "מפתח פריט": "XRKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "XR",
    "שם פריט אב": "גת XR מוצר אב",
    "תרה כמותית אב": 93.6,
  },
  {
    "שם פריט": "גת קימבו לפי משקל",
    "מפתח פריט": "KIKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "כבל אודיו לפי מטר",
    "מפתח פריט": "B54012",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55009",
    "שם פריט אב": "גליל כבל אודיו לפי מטר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "כבל אודיו לפי מטר",
    "מפתח פריט": "B54012",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55009",
    "שם פריט אב": "גליל כבל אודיו לפי מטר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "כבל תקשורת לפי מטר",
    "מפתח פריט": "B54015",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55008",
    "שם פריט אב": "גליל כבל תקשורת לפי מטר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "כבל תקשורת לפי מטר",
    "מפתח פריט": "B54015",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55008",
    "שם פריט אב": "גליל כבל תקשורת לפי מטר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "כבל נחושת לפי מטר",
    "מפתח פריט": "B54019",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55007",
    "שם פריט אב": "גליל כבל נחושת לפי מטרר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "כבל נחושת לפי מטר",
    "מפתח פריט": "B54019",
    "קוד מיון": 54004,
    "יתרה כמותית במלאי": 0,
    משקל: 0,
    מחסן: 101,
    "מפתח פריט אב": "S55007",
    "שם פריט אב": "גליל כבל נחושת לפי מטרר",
    "תרה כמותית אב": 0,
  },
  {
    "שם פריט": "גת בייבי לפי משקל",
    "מפתח פריט": "BBKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "BB",
    "שם פריט אב": "גת בייבי מוצר אב",
    "תרה כמותית אב": -485.2,
  },
  {
    "שם פריט": "גת בייבי לפי משקל",
    "מפתח פריט": "BBKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "BB",
    "שם פריט אב": "גת בייבי מוצר אב",
    "תרה כמותית אב": -485.2,
  },
  {
    "שם פריט": "גת אבו מיסמר לפי משקל",
    "מפתח פריט": "ABKG",
    "קוד מיון": 51200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "גת SP מובחר לפי משקל",
    "מפתח פריט": "SPKG",
    "קוד מיון": 52200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "SP",
    "שם פריט אב": "גת SP מוצר אב",
    "תרה כמותית אב": -740.4200000000001,
  },
  {
    "שם פריט": "רובטה נתיבות",
    "מפתח פריט": "SA500SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.5,
    מחסן: 1,
    "מפתח פריט אב": "RB",
    "שם פריט אב": "גת נתיבות מוצר אב",
    "תרה כמותית אב": -4.5,
  },
  {
    "שם פריט": "קימבו קטן",
    "מפתח פריט": "KI100SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "KI",
    "שם פריט אב": "גת קימבו מוצר אב",
    "תרה כמותית אב": -365.5,
  },
  {
    "שם פריט": "גת XP לפי משקל",
    "מפתח פריט": "XPKG",
    "קוד מיון": 53200,
    "יתרה כמותית במלאי": 0,
    משקל: 1,
    מחסן: 1,
    "מפתח פריט אב": "XP",
    "שם פריט אב": "גת XP מוצר אב",
    "תרה כמותית אב": 850.5000000000003,
  },
  {
    "שם פריט": "גת XR",
    "מפתח פריט": "XR100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BAGXP",
    "שם פריט אב": "שקית לגת XP",
    "תרה כמותית אב": -1648,
  },
  {
    "שם פריט": "גת XR",
    "מפתח פריט": "XR100SA",
    "קוד מיון": 52000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.1,
    מחסן: 1,
    "מפתח פריט אב": "BAGXP",
    "שם פריט אב": "שקית לגת XP",
    "תרה כמותית אב": -1648,
  },
  {
    "שם פריט": "אבו מיסמר גדול",
    "מפתח פריט": "AB500SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.5,
    מחסן: 2,
    "מפתח פריט אב": "AB",
    "שם פריט אב": "גת אבו מיסמר מוצר אב",
    "תרה כמותית אב": -765.25,
  },
  {
    "שם פריט": "הרנה 250 גרם",
    "מפתח פריט": "HI250SA",
    "קוד מיון": 51000,
    "יתרה כמותית במלאי": 0,
    משקל: 0.25,
    מחסן: 1,
    "מפתח פריט אב": "HI",
    "שם פריט אב": "גת הרנה מוצר אב",
    "תרה כמותית אב": -36481.75,
  },
];
